Revit 2024 API
View.AreModelCategoriesHidden Property
 Indicates if model categories are currently hidden in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool AreModelCategoriesHidden { get; set; }
Visual Basic
Public Property AreModelCategoriesHidden As Boolean
	Get
	Set
Visual C++
public:
property bool AreModelCategoriesHidden {
	bool get ();
	void set (bool value);
}
Field Value
 True if model categories are currently hidden in the view, false otherwise.
See Also
View Class
Autodesk.Revit.DB Namespace